In [1]:
import pandas as pd

In [14]:
data = {
    'year_graduation' : ['1º', '2º', '3º', '4º', 'total'],
    'enrollments_march': [70, 50, 47, 23, 190],
    'enrollments_november': [65, 48, 40, 22, 175],
}

data

{'year_graduation': ['1º', '2º', '3º', '4º', 'total'],
 'enrollments_march': [70, 50, 47, 23, 190],
 'enrollments_november': [65, 48, 40, 22, 175]}

In [15]:
df = pd.DataFrame(data)
df

  year_graduation  enrollments_march  enrollments_november
0              1º                 70                    65
1              2º                 50                    48
2              3º                 47                    40
3              4º                 23                    22
4           total                190                   175

In [16]:
df['coef_evasion'] = abs(df['enrollments_march'] - df['enrollments_november'] )/ df['enrollments_march']
df

  year_graduation  enrollments_march  enrollments_november  coef_evasion
0              1º                 70                    65      0.071429
1              2º                 50                    48      0.040000
2              3º                 47                    40      0.148936
3              4º                 23                    22      0.043478
4           total                190                   175      0.078947

In [17]:
df['rate_evasion'] = df['coef_evasion'] * 100
df

,year_graduation,enrollments_march,enrollments_november,coef_evasion,rate_evasion
0,1º,70,65,0.071429,7.142857
1,2º,50,48,0.040000,4.000000
2,3º,47,40,0.148936,14.893617
3,4º,23,22,0.043478,4.347826
4,total,190,175,0.078947,7.894737